{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "a2fd1dfc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите кол-во чисел: 5\n",
      "Введите число № 1: 1\n",
      "Введите число № 2: 2\n",
      "Введите число № 3: 3\n",
      "Введите число № 4: 2\n",
      "Введите число № 5: 1\n",
      "rez : 3\n"
     ]
    }
   ],
   "source": [
    "# Task 1 Дан список чисел. \n",
    "# Напишите программу, которая определяет, сколько в нем встречается различных чисел, используя множества.\n",
    "# Входные данные:    1, 2, 3, 2, 1\n",
    "# Выходные значения: 3\n",
    "n = int(input('Введите кол-во чисел: '))\n",
    "s = set()\n",
    "for i in range(n):\n",
    "    s.update({input('Введите число № ' + str(i+1) + ': ')})\n",
    "list_a = s\n",
    "print('rez :', len(set(list_a)))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "de2bab6d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите кол-во чисел первого списка: 3\n",
      "Введите кол-во чисел второго списка: 3\n",
      "Введите число № 1 для первого списка: 1\n",
      "Введите число № 2 для первого списка: 2\n",
      "Введите число № 3 для первого списка: 3\n",
      "Введите число № 1 для второго списка: 1\n",
      "Введите число № 2 для второго списка: 4\n",
      "Введите число № 3 для второго списка: 5\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# Task 2 Даны два списка чисел. \n",
    "# Напишите программу, которая определяет, сколько в них встречается общих чисел, используя множества.\n",
    "# Входные данные:     1, 2, 3\n",
    "#                     1, 4, 5\n",
    "# Выходные значения:  1\n",
    "n_1 = int(input('Введите кол-во чисел первого списка: '))\n",
    "n_2 = int(input('Введите кол-во чисел второго списка: '))\n",
    "s_1 = set()\n",
    "s_2 = set()\n",
    "for i in range(n_1):\n",
    "    s_1.update({input('Введите число № ' + str(i+1) + ' для первого списка: ')})\n",
    "for i in range(n_2):\n",
    "    s_2.update({input('Введите число № ' + str(i+1) + ' для второго списка: ')})\n",
    "list_a = s_1\n",
    "list_b = s_2\n",
    "man_a = set(list_a)\n",
    "man_b = set(list_b)\n",
    "man_rez = man_a.intersection(man_b)\n",
    "print(\"rez :\", len(man_rez))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "79681b6a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите кол-во чисел первого множества: 3\n",
      "Введите кол-во чисел второго множества: 5\n",
      "Введите число № 1 для первого множества: 1\n",
      "Введите число № 2 для первого множества: 3\n",
      "Введите число № 3 для первого множества: 5\n",
      "Введите число № 1 для второго множества: 1\n",
      "Введите число № 2 для второго множества: 2\n",
      "Введите число № 3 для второго множества: 3\n",
      "Введите число № 4 для второго множества: 4\n",
      "Введите число № 5 для второго множества: 5\n",
      "True\n"
     ]
    }
   ],
   "source": [
    "# Task 3 Даны два множества чисел. \n",
    "# Напишите программу, которая определяет, является ли первое множество подмножеством второго. \n",
    "# Множество является подмножеством другого множества, если все данные первого совпадают с частью данных из второго.\n",
    "# Если множества совпадают, они не являются подмножествами друг друга.\n",
    "# Входные данные:     {1, 2, 3}\n",
    "#                     {1, 4, 5}\n",
    "# Выходные значения:  False\n",
    "n_1 = int(input('Введите кол-во чисел первого множества: '))\n",
    "n_2 = int(input('Введите кол-во чисел второго множества: '))\n",
    "s_1 = set()\n",
    "s_2 = set()\n",
    "for i in range(n_1):\n",
    "    s_1.update({input('Введите число № ' + str(i+1) + ' для первого множества: ')})\n",
    "for i in range(n_2):\n",
    "    s_2.update({input('Введите число № ' + str(i+1) + ' для второго множества: ')})\n",
    "man_a = s_1\n",
    "man_b = s_2\n",
    "rez = man_a.issubset(man_b)\n",
    "print(rez)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
