{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "18b7c396",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите длину словаря: 2\n",
      "Введите ключ: 1\n",
      "Введите значение: 2\n",
      "Введите ключ: 3\n",
      "Введите значение: 4\n",
      "Введите ключ для поиска: 3\n",
      "rez = 4\n"
     ]
    }
   ],
   "source": [
    "# Task 1 Задан словарь. Напишите программу, которая будет выводить значение по заданному ключу.\n",
    "n = int(input('Введите длину словаря: '))\n",
    "d = dict()\n",
    "for i in range(n):\n",
    "    d.update({input('Введите ключ: '):input('Введите значение: ')})\n",
    "key = input('Введите ключ для поиска: ')\n",
    "print(\"rez =\", d.get(key))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "d1cd4cb1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите длину словаря: 1\n",
      "Введите ключ: 5\n",
      "Введите значение: 3\n",
      "Введите значение для поиска: 3\n",
      "rez =  5\n"
     ]
    }
   ],
   "source": [
    "# Task 2 Напишите программу, которая будет выполнять действие, обратное заданию 1.\n",
    "# Программа должна производить поиск по значению и выдавать ключ.\n",
    "n = int(input('Введите длину словаря: '))\n",
    "d = dict()\n",
    "for i in range(n):\n",
    "    d.update({input('Введите ключ: '):input('Введите значение: ')})\n",
    "d_val = list(d.values())\n",
    "d_keys = list(d.keys())\n",
    "k_len = len(d_keys)\n",
    "var = input('Введите значение для поиска: ')\n",
    "i = 0\n",
    "while (i < k_len):\n",
    "  if (d_val[i] == var):\n",
    "    break\n",
    "  i += 1\n",
    "print('rez =', d_keys[i])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "ffd559fe",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите длину списка: 1\n",
      "Введите элемент № 1: 2\n",
      "rez :1 "
     ]
    }
   ],
   "source": [
    "#  Task 3 Напишите программу, которая принимает список строк и выводит количество повторений данных строк в списке.\n",
    "n = int(input('Введите длину списка: '))\n",
    "lst = []\n",
    "for i in range(n):\n",
    "    lst.append(input('Введите элемент № '+str(i+1)+': '))\n",
    "str_list = lst\n",
    "len_str = len(str_list)\n",
    "i = 0\n",
    "str_dict = d.fromkeys([str_list[i]], str_list.count(str_list[i]))\n",
    "while (i < len_str):\n",
    "  if (str_dict.get(str_list[i]) == None):\n",
    "    str_dict[str_list[i]] = str_list.count(str_list[i])\n",
    "  i += 1\n",
    "rez_list = list(str_dict.values())\n",
    "i = 0\n",
    "print('rez :', end = \"\")\n",
    "while ( i < len(rez_list)):\n",
    "  print(rez_list[i], end = ' ')\n",
    "  i += 1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8dc43b96",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
