{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "57ef82c2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['1', '3', '5']\n"
     ]
    }
   ],
   "source": [
    "# Task 1 Задан список с числами. \n",
    "# Напишите программу, которая выводит все элементы списка с четными индексами в виде нового списка.\n",
    "n = int(input('Введите длину списка: '))\n",
    "a = []\n",
    "for i in range(n):\n",
    "    a.append(int(input('Введите число №'+str(i+1)+': ')))\n",
    "rez = []\n",
    "len_a = n\n",
    "i = 0\n",
    "while (i < len_a):\n",
    "    if (i % 2 == 0):\n",
    "        rez.append(a[i])\n",
    "    i += 1\n",
    "print(rez)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "6e438083",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите длину списка: 3\n",
      "Введите число №1: 1\n",
      "Введите число №2: 3\n",
      "Введите число №3: 2\n",
      "[3]\n"
     ]
    }
   ],
   "source": [
    "# Task 2 Задан список с числами.\n",
    "# Напишите программу, которая выводит все элементы списка, которые больше предыдущего, в виде отдельного списка.\n",
    "n = int(input('Введите длину списка: '))\n",
    "a = []\n",
    "for i in range(n):\n",
    "    a.append(int(input('Введите число №'+str(i+1)+': ')))\n",
    "rez = []\n",
    "len_a = n\n",
    "i = 1\n",
    "while (i < len_a):\n",
    "    if (a[i] > a[i - 1]):\n",
    "        rez.append(a[i])\n",
    "    i += 1\n",
    "print(rez)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "1638221f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите длину списка: 2\n",
      "Введите число №1: 5\n",
      "Введите число №2: 6\n",
      "[6, 5]\n"
     ]
    }
   ],
   "source": [
    "# Task 3 Задан список с числами.\n",
    "# Напишите программу, которая меняет местами наибольший и наименьший элемент и выводит новый список.\n",
    "n = int(input('Введите длину списка: '))\n",
    "a = []\n",
    "for i in range(n):\n",
    "    a.append(int(input('Введите число №'+str(i+1)+': ')))\n",
    "len_a = n\n",
    "min_a = a[0]\n",
    "max_a = a[0]\n",
    "i = 1\n",
    "while (i < len_a):\n",
    "    if (max_a < a[i]):\n",
    "        max_a = a[i]\n",
    "    if (min_a > a[i]):\n",
    "        min_a = a[i]\n",
    "    i += 1\n",
    "ind_max = a.index(max_a)\n",
    "ind_min = a.index(min_a)\n",
    "a.pop(ind_max)\n",
    "a.insert(ind_max, min_a)\n",
    "a.remove(min_a)\n",
    "a.insert(ind_min, max_a)\n",
    "print(a)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
